RT-Thread/rt-thread/bsp/efm32/Libraries/CMSIS/CM3/DeviceSupport/EnergyMicro/EFM32/efm32gg942f1024.h
/* Bit fields for USB FIFO4D_FIFO4D */
#define _USB_FIFO4D_FIFO4D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO4D_FIFO4D */
#define _USB_FIFO4D_FIFO4D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO4D_FIFO4D */
#define _USB_FIFO4D_FIFO4D_FIFO4D_SHIFT            0                                        /**< Shift value for USB_FIFO4D */
#define _USB_FIFO4D_FIFO4D_FIFO4D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO4D */
#define _USB_FIFO4D_FIFO4D_FIFO4D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO4D_FIFO4D */
#define USB_FIFO4D_FIFO4D_FIFO4D_DEFAULT           (_USB_FIFO4D_FIFO4D_FIFO4D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO4D_FIFO4D */

/* Bit fields for USB FIFO5D_FIFO5D */
#define _USB_FIFO5D_FIFO5D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO5D_FIFO5D */
#define _USB_FIFO5D_FIFO5D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO5D_FIFO5D */
#define _USB_FIFO5D_FIFO5D_FIFO5D_SHIFT            0                                        /**< Shift value for USB_FIFO5D */
#define _USB_FIFO5D_FIFO5D_FIFO5D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO5D */
#define _USB_FIFO5D_FIFO5D_FIFO5D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO5D_FIFO5D */
#define USB_FIFO5D_FIFO5D_FIFO5D_DEFAULT           (_USB_FIFO5D_FIFO5D_FIFO5D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO5D_FIFO5D */

/* Bit fields for USB FIFO6D_FIFO6D */
#define _USB_FIFO6D_FIFO6D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO6D_FIFO6D */
#define _USB_FIFO6D_FIFO6D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO6D_FIFO6D */
#define _USB_FIFO6D_FIFO6D_FIFO6D_SHIFT            0                                        /**< Shift value for USB_FIFO6D */
#define _USB_FIFO6D_FIFO6D_FIFO6D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO6D */
#define _USB_FIFO6D_FIFO6D_FIFO6D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO6D_FIFO6D */
#define USB_FIFO6D_FIFO6D_FIFO6D_DEFAULT           (_USB_FIFO6D_FIFO6D_FIFO6D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO6D_FIFO6D */

/* Bit fields for USB FIFO7D_FIFO7D */
#define _USB_FIFO7D_FIFO7D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO7D_FIFO7D */
#define _USB_FIFO7D_FIFO7D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO7D_FIFO7D */
#define _USB_FIFO7D_FIFO7D_FIFO7D_SHIFT            0                                        /**< Shift value for USB_FIFO7D */
#define _USB_FIFO7D_FIFO7D_FIFO7D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO7D */
#define _USB_FIFO7D_FIFO7D_FIFO7D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO7D_FIFO7D */
#define USB_FIFO7D_FIFO7D_FIFO7D_DEFAULT           (_USB_FIFO7D_FIFO7D_FIFO7D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO7D_FIFO7D */

/* Bit fields for USB FIFO8D_FIFO8D */
#define _USB_FIFO8D_FIFO8D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO8D_FIFO8D */
#define _USB_FIFO8D_FIFO8D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO8D_FIFO8D */
#define _USB_FIFO8D_FIFO8D_FIFO8D_SHIFT            0                                        /**< Shift value for USB_FIFO8D */
#define _USB_FIFO8D_FIFO8D_FIFO8D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO8D */
#define _USB_FIFO8D_FIFO8D_FIFO8D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO8D_FIFO8D */
#define USB_FIFO8D_FIFO8D_FIFO8D_DEFAULT           (_USB_FIFO8D_FIFO8D_FIFO8D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO8D_FIFO8D */

/* Bit fields for USB FIFO9D_FIFO9D */
#define _USB_FIFO9D_FIFO9D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO9D_FIFO9D */
#define _USB_FIFO9D_FIFO9D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO9D_FIFO9D */
#define _USB_FIFO9D_FIFO9D_FIFO9D_SHIFT            0                                        /**< Shift value for USB_FIFO9D */
#define _USB_FIFO9D_FIFO9D_FIFO9D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO9D */
#define _USB_FIFO9D_FIFO9D_FIFO9D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO9D_FIFO9D */
#define USB_FIFO9D_FIFO9D_FIFO9D_DEFAULT           (_USB_FIFO9D_FIFO9D_FIFO9D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO9D_FIFO9D */

/* Bit fields for USB FIFO10D_FIFO10D */
#define _USB_FIFO10D_FIFO10D_RESETVALUE            0x00000000UL                                /**< Default value for USB_FIFO10D_FIFO10D */
#define _USB_FIFO10D_FIFO10D_MASK                  0xFFFFFFFFUL                                /**< Mask for USB_FIFO10D_FIFO10D */
#define _USB_FIFO10D_FIFO10D_FIFO10D_SHIFT         0                                           /**< Shift value for USB_FIFO10D */
#define _USB_FIFO10D_FIFO10D_FIFO10D_MASK          0xFFFFFFFFUL                                /**< Bit mask for USB_FIFO10D */
#define _USB_FIFO10D_FIFO10D_FIFO10D_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for USB_FIFO10D_FIFO10D */
#define USB_FIFO10D_FIFO10D_FIFO10D_DEFAULT        (_USB_FIFO10D_FIFO10D_FIFO10D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO10D_FIFO10D */

/* Bit fields for USB FIFO11D_FIFO11D */
#define _USB_FIFO11D_FIFO11D_RESETVALUE            0x00000000UL                                /**< Default value for USB_FIFO11D_FIFO11D */
#define _USB_FIFO11D_FIFO11D_MASK                  0xFFFFFFFFUL                                /**< Mask for USB_FIFO11D_FIFO11D */
#define _USB_FIFO11D_FIFO11D_FIFO11D_SHIFT         0                                           /**< Shift value for USB_FIFO11D */
#define _USB_FIFO11D_FIFO11D_FIFO11D_MASK          0xFFFFFFFFUL                                /**< Bit mask for USB_FIFO11D */
#define _USB_FIFO11D_FIFO11D_FIFO11D_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for USB_FIFO11D_FIFO11D */
#define USB_FIFO11D_FIFO11D_FIFO11D_DEFAULT        (_USB_FIFO11D_FIFO11D_FIFO11D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO11D_FIFO11D */

